{
  "workflowId": "308cfabd-20cf-49b5-bade-964855c86022",
  "status": "initialized",
  "objective": {
    "id": "308cfabd-20cf-49b5-bade-964855c86022",
    "text": [
      "ssss"
    ],
    "files": [
      {
        "name": "CHABAUD - compétences Akkodis.docx",
        "path": "C:\\Users\\UTILIS~1\\AppData\\Local\\Temp\\df03c56649ad856ba7d14b100",
        "type": "application/vnd.openxmlformats-officedocument.wordprocessingml.document",
        "content": "DOMAINES D’EXPERTISES TECHNIQUES\n\n\n\n\n\nÉtudes R&T, Innovation \n\nInstallation & intégration systèmes\n\nDéveloppement de système d'affichage, cockpit/planche de bord, multimedia\n\nDéveloppement de logiciels scientifiques et techniques\n\nCalculs et simulations ‘non fluides’ (calculs structure de type vibratoires, stress,…)\n\nProgiciel SAP \n\nBusiness Intelligence\n\nTechnologies et Portails Web\n\nSolutions éditeurs (outils de gestion de documentation, de réservation,…)\n\nTests & diagnostics\n\nlogiciel, électroniqu\n\n\n\nSECTEURS D’ACTIVITÉ\n\n\n\nAssurance\n\nE-Commerce\n\nMutuelle\n\naéronautique\n\n\n\n\n\nMETHODOLOGIES ET TECHNOLOGIQUES MAITRISEES\n\n\n\nTECHNIQUES : \n\nNORMES ET METHODES :AGILE, CYCLE EN V, CMMI NIVEAU 3, D0178B, ARINC429. \n\nSYST. EXPLOITATIONS : UNIX, WINDOWS, MAC OS. \n\nLANGUAGES: C/C++, MATLAB, LABVIEW, FORTRAN, PERL, XSLT\n\nCOMPILATEURS : GCC, G++, G77.\n\nGESTION DE CONF.: CLEARCASE, TORTOISE SVN, GITHUB \n\nOUTILS: VISUAL, ECLIPSE, EAGLE, ARDUINO, LABWINDOWS CVI, SPICE, VSCODE, INTELLIJ\n\n\n\nFONCTIONNELLES : \n\nELECTRONIQUE ANALOGIQUE ET NUMERIQUE, \n\nINFORMATIQUE INDUSTRIELLE & WEB \n\nTRAITEMENT DU SIGNAL SON ET IMAGE, \n\nSYSTEMES EMBARQUES / TEMPS REEL / CAPTEURS AERONAUTIQUE / MULTIMEDIA \n\n\n\n\n\n\n\nEXPERIENCE PROFESSIONNELLE - PROJETS EFFECTUÉS\n\n\n\nPROJETS : INGENIEUR INFORMATIQUE INDUSTRIELLE de 2008 à 2021\n\nFEVRIER 2019 (26 MOIS) : INGENIEUR D’ETUDE - STYREL (BEGLES - 33) \n\nJUILLET 2018 (3 MOIS) : INGENIEUR DE RECHERCHE - ALTEN (MERIGNAC - 33) \n\nAVRIL 2017 (12 MOIS) : INGENIEUR DE RECHERCHE - SKYFX (MERIGNAC - 33) \n\nMARS 2016 (10 MOIS) : INGENIEUR D’ETUDE - AKKA TECHNOLOGIES (MERIGNAC - 33) \n\nNOV. 2012 (4 ANS) : INGENIEUR DEVELOPPEMENT - THALES SERVICES (MERIGNAC - 33) \n\nAOUT 2008 (4 ANS) : INGENIEUR CONSULTANT - SII (MERIGNAC - 33) \n\n\n\n\n\nPROJET : DEVELOPPEMENT SITE INTERNET POUR CTRL-UP (33) - JUILLET 2022 (9 MOIS) \n\n\n\nENVIRONNEMENT : \n\nREACT, TYPESCRIPT, ESLINT, STYLELINT, NODE, MONGODB, INTEGRATION CONTINUE, GIT HUB, TEST JEST, AGILE, REUNIONS AVEC LES EQUIPES UX/UI DESIGN - FRONT ET COTE BACK – API, TEAMS, DISCORD, SLACK, MIRO, CONFLUENCE, IN VISION, EQUIPE EN FULL REMOTE \n\n\n\nDETAILS : \n\nDéveloppement \"from scratch\" d’une application pour les courtiers en banque (Back office et Front office). Le BO permet à l’utilisateur Admin de créer et gérer les équipes, et propose une création d’étude (dashboard, démographie, recueil des besoins, page des garanties, gestion d’envoie d’email... ). Etroite collaboration avec l’équipe UX-UI (IN VISION). Mise en place d’une librairie de composant React (table, formulaire, typo…). Mise en place d’une librairie de génération automatique de queries, mutations et Front Jsx à partir de fichiers de configuration yml. Formation de collaborateurs \n\n\n\nPROJET : DEVELOPPEMENT SITES INTERNET POUR PALO-IT (44) - JANVIER 2022 (6 MOIS) \n\n\n\nENVIRONNEMENT : \n\nREACT, REACT ADMIN, TYPESCRIPT, ESLINT, STYLELINT, CALL API, PHP, POSTMAN, SYMFONY, INTEGRATION CONTINUE, GIT HUB, TEST JEST, AGILE, REUNIONS AVEC LES EQUIPES UX/UI DESIGN - FRONT ET COTE BACK – API, TEAMS, DISCORD, SLACK, MIRO, CONFLUENCE, FIGMA, EQUIPE EN FULL REMOTE \n\n\n\nDETAILS : \n\nDéveloppement \"from scratch\" de deux sites internet (Back office et Front office). Le BO permet à l’utilisateur Admin de créer des opérations de remerciements pour ses clients (configuration des cadeaux, paramétrage de la boutique Front office, wizard de gestion des participants et des opérations, Dashboard...), et propose une boutique (FO) personnalisable et modulable pour chaque opération. Etroite collaboration avec l’équipe UX-UI (Figma). Mise en place d’une librairie de composant React (table, formulaire, typo…). \n\n\n\n\n\nPROJET : DEVELOPPEMENT D’APPLICATIONS POUR LABO IMS (33) - OCTOBRE 2021 (3 MOIS) \n\n\n\nENVIRONNEMENT : \n\nLABVIEW, IHM, ERGONOMIE UX, ELECTRONIQUE, TRAITEMENT DE SIGNAL, CONTEXTE BIOLOGIE CELLULAIRE \n\n\n\nDETAILS : \n\nMise en place d'une expérience de recherche pour l'étude de l'influence des ondes radio-fréquence sur des cellules vivantes. Développement d'une application LABVIEW pour communiquer avec le spectromètre, les capteurs de température et le mitigeur électronique. Mise en place d'un système asservi avec correcteur PID pour régler la température du milieu cellulaire. Traitement de signal, analyse spectrale et modélisation gaussienne. Réalisation d'une IHM ergonomique et responsive. Demos d'utilisation en video de l'application \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPROJET : DEVELOPPEMENT D’APPLICATIONS WEB POUR LECTRA (33) - MAI 2021 (5 MOIS) \n\n\n\nENVIRONNEMENT : \n\nREACT-JS, NODE-JS, JSX, KOTLIN, MICRO-SERVICE, AMQP, DOCKER, GITLAB, JEST, JUNIT; CI - JENKINS \n\n\n\nDETAILS : \n\nRéunion avec les PO pour détailler les spécifications, développement ReactJs pour le Front, Kotlin et NodeJs pour le Back. Architecture MVC, communication AMQP entre Front et Micro-Service. Traitement des cases Clients et écriture de FAQ pour la traçabilité des faits techiniques. Développement piloté par les Tests (TDD) avec Junit et Jest. Intégration continue avec Jenkins. \n\n\n\n\n\nPROJET : CREATION SITE INTERNET PORTE-FOLIO PERSONNEL (33) - MARS 2021 (2 MOIS) \n\n\n\nENVIRONNEMENT : \n\nAXIOS, FORMIK, YUP, REACT-HELMET, REACT-IFRAME, REACT-PLAYER, REACT-SCROLL, REACT-TRANSITION-GROUP, REACTROUTER-DOM, PHPMAILER.\n\n\n\nLIBRAIRIES : AXIOS, FORMIK, YUP, REACT-HELMET, REACT-IFRAME, REACT-PLAYER, REACT-SCROLL, REACT-TRANSITION-GROUP, REACTROUTER-DOM, PHPMAILER.  \n\n\n\nDETAILS : \n\nSite portefolio avec page de contact, page formulaire pour l’envoi d’email et page de portefolio avec intégration de lecteur PDF, de lecteur youTube, utilisation de CSS_transition pour le design et gérer les transitions lors d’un changement de page avec React-Router, test unitaire, Responsive Design (site adapté à tous types de tailles d'écrans), Mise en ligne et maintenance. Certificat SSL. \n\n\n\nPROJET : : CREATION SITE INTERNET E-COMMERCE POUR HOME-DECOR (33) - JUILLET 2020 (8 MOIS) \n\n\n\nENVIRONNEMENT : \n\nREACT-JS, NODE-JS, JAVASCRIPT JSX, PHP, SQL, HTML/CSS, DONNEES SERVEUR, API, ARCHITECTURE MVC-JSON, BOOTSTRAP, GIT, GOOGLESEARCHCONSOLE, TEST UNITAIRE. \n\n\n\nLIBRAIRIES : AXIOS, FORMIK, YUP, REACT-HELMET, REACT-SCROLL, REACT-ROUTER-DOM, REACT-PAYPAL-BUTTON-V2, PHPMAILER.  \n\n\n\nDETAILS : \n\nContenu administratif et publique, Inscription et page client avec contenu privée, Gestions des e-mails et messagerie interne (envoie et suppression de message, NewsLetters), Formulaire et Paiement sécurisé en ligne (Paypal , CB), Gestion des ventes et de la facturation (paiements en attentes et annonces vendues), Gestions des annonces (créer, modifier, supprimer, visualiser, acheter), Moteur de recherche du site, Référencement naturel - conseils pour le référencement par contenu et mots clés, Responsive Design (site adapté à tous types de tailles d'écrans), validation et recette. Mise en ligne et maintenance. Certificat SSL. J’ai réalisé une version de ce site entièrement en HTML et CSS pour maquette. Pour des raisons de maintenabilité et de compatibilité j'ai porté tout le code en ReactJS. \n\n\n\n\n\nPROJET : TMA SIROCO POUR COLAS-SPEIG (78) - 2015 (12 MOIS) \n\n\n\nENVIRONNEMENT : \n\nJAVASCRIPT, PHP, SQL, HTML/CSS, TORTOISE SVN, JIRA, CONFLUENCE, SQUASH \n\n\n\nDETAILS : \n\nMontée en compétence sur l’application TIAMP et son architecture, correction des incidents et codage des évolutions (gestion de clients, commandes clients, édition de factures, import Excel affaires, pointages, rapport chantier, heures travaillées, gestion des droits), écriture des spécifications, validation (tests de non régression) de l’application. \n\nFORMATION ET ACQUIS TECHNIQUES\n\n\n\nLangues\n\nANGLAIS – TOEIC (720) \n\n\n\nDiplômes\n\n2005 - 2008 – INGENIEUR ELECTRONIQUE ET INFORMATIQUE INDUSTRIELLE - ÉCOLE POLYTECHNIQUE UNIVERSITE DE NANTES (2005-2008) \n\n2004 - 2005 – PREPA MATSUP/SPE – Lyçée Gustave Eiffel – Bordeaux (33)\n\n2002 - 2004 – BTS Electronique – Lycée Champollion – Figeac (46)\n\n2000 - 2002 – BAC Electronique – Lycée Champollion – Figeac (46)\n\n1998 - 2000 – BEP Electronique – Lycée Champollion – Figeac (46)"
      }
    ]
  },
  "tasks": [],
  "agents": [],
  "memory": {
    "version": 1,
    "content": {
      "byAgent": {},
      "byTask": {}
    }
  },
  "logs": [
    {
      "type": "info",
      "message": "🚀 Nouveau workflow initialisé."
    },
    {
      "type": "info",
      "message": "🎯 Objectif enregistré : ssss"
    }
  ],
  "output": null,
  "validation": null
}